app/controllers/pokemons_controller.rb

INSERT INTO "pokemons" ("num", "name", "img", "height", "weight", "candy", "candy_count", "egg", "avg_spawns", "spawn_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
    def create
        @pokemon = Pokemon.new(pokemon_params)

        if @pokemon.save

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @pokemon = Pokemon.find(params[:id])

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 152], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 152]]
---
    def destroy
        @pokemon = Pokemon.find(params[:id])
        @pokemon.destroy